README is updated with diagram
